import React from "react";
import Logo from './assets/images/logo.png';

const menuItems: {id: number, title: string, description: string, price: string}[] = [
    {
        id: 1,
        title: 'Չահան բանջարեղեն',
		price: '1500 դրամ',
		description: `(դդմիկ, գազար, բիբար, սխտոր, կանաչ սոխ, սոուս)<br>
            <ul>
            <li>+հավի միս - <b>250 դրամ</b></li>
            <li>+տավարի միս - <b>550 դրամ</b></li>
            <li>+խոզի միս - <b>450 դրամ</b></li>
            <li>+մանրածովախեցգետին - <b>1000 դրամ</b></li>
            </ul>
        `
    },
    {
        id: 2,
        title: 'Ուդոն բանջարեղեն',
		price: '1500 դրամ',
		description: `(դդմիկ, գազար, բիբար, սխտոր, կանաչ սոխ, սոուս)<br>
            <ul>
            <li>+հավի միս - <b>250 դրամ</b></li>
            <li>+տավարի միս - <b>550 դրամ</b></li>
            <li>+խոզի միս - <b>450 դրամ</b></li>
            <li>+մանրածովախեցգետին - <b>1000 դրամ</b></li>
            </ul>
        `
    },
    {
        id: 3,
        title: 'Սոբա բանջարեղեն',
		price: '1500 դրամ',
		description: `(դդմիկ, գազար, բիբար, սխտոր, կանաչ սոխ, սոուս)<br>
            <ul>
            <li>+հավի միս - <b>250 դրամ</b></li>
            <li>+տավարի միս - <b>550 դրամ</b></li>
            <li>+խոզի միս - <b>450 դրամ</b></li>
            <li>+մանրածովախեցգետին - <b>1000 դրամ</b></li>
            </ul>
        `
    },
    {
        id: 4,
        title: 'Ֆունչոզա բանջարեղեն',
		price: '1500 դրամ',
		description: `(դդմիկ, գազար, բիբար, սխտոր, կանաչ սոխ, սոուս)<br>
            <ul>
            <li>+հավի միս - <b>250 դրամ</b></li>
            <li>+տավարի միս - <b>550 դրամ</b></li>
            <li>+խոզի միս - <b>450 դրամ</b></li>
            <li>+մանրածովախեցգետին - <b>1000 դրամ</b></li>
            </ul>
        `
    },
    {
        id: 5,
        title: 'Յակի մակի',
		price: '2300 դրամ',
		description: `(բրինձ, սաղմոն, նորի)`
    },
    {
        id: 6,
        title: 'Մագուրո մակի',
		price: '2100 դրամ',
		description: `(բրինձ, թունա, նորի)`
    },
    {
        id: 7,
        title: 'Ավոկադո մակի',
		price: '1700 դրամ',
		description: `(բրինձ, նորի, ավոկադո)`
    },
    {
        id: 8,
        title: 'Ունագի մակի',
		price: '2400 դրամ',
		description: `(բրինձ, օձաձուկ, նորի, ունագի սոուս, քունջութ)`
    },
    {
        id: 9,
        title: 'Կծու ծովախեցգետին',
		price: '2000 դրամ',
		description: `(բրինձ, նորի, կծու սոուս, ծովախեցգետին)`
    },
    {
        id: 10,
        title: 'Բանզայ',
		price: '3000 դրամ',
		description: `(մասագո, չեդդեր, քունջութ, վարունգ, մանրածովախեցգետին, կանաչ սոխ)`
    },
    {
        id: 11,
        title: 'Ֆիլադելֆիա',
		price: '3500 դրամ',
		description: `(պանիր, վարունգ, սաղմոն)`
    },
    {
        id: 12,
        title: 'Ֆիլադելֆիա լյուքս',
		price: '4800 դրամ',
		description: `(պանիր, վարունգ, սաղմոն, կամադարի պանիր, սաղմոնի իկռա)`
    },
    {
        id: 13,
        title: 'Ֆիլադելֆիա օձաձուկ',
		price: '5100 դրամ',
		description: `(պանիր, ավոկադո, օձաձուկ, սաղմոն)`
    },
    {
        id: 14,
        title: 'Կալիֆորնիա խեցգետին',
		price: '3600 դրամ',
		description: `(կալիֆորնիական խառնուրդ, ավոկադո, սև մասագո, նարնջագույն մասագո)`
    },
    {
        id: 15,
        title: 'Տապակած կալիֆորնիա',
		price: '3700 դրամ',
		description: `(կալիֆորնիական խառնուրդ, ավոկադո, մասագո տապակած սոուս, ունագի սոուս)`
    },
    {
        id: 16,
        title: 'Իզումի',
		price: '3800 դրամ',
		description: `(պանիր, վարունգ, քունջութ, կծու սոուս, տելապիա, մասագո, կանաչ սոխ)`
    },
    {
        id: 17,
        title: 'Կիմոնո',
		price: '5000 դրամ',
		description: `(կծու սոուս կաղամարի տեմպուրա, վարունգ, թունա, խնձոր, քաղցր չիլի, միկրոկանաչի)`
    },
    {
        id: 18,
        title: 'Ավոկադո ռոլլ',
		price: '4600 դրամ',
		description: `(պանիր, ամլետ, սաղմոն, կանաչ սոխ, տապակած սոխ, ավոկադո, ունագի սոուս, միկրոկանաչի)`
    },
    {
        id: 19,
        title: 'Չուկա ռոլլ',
		price: '5000 դրամ',
		description: `(պանիր, ավոկադո, տեկուան, կանաչ մասագո, սաղմոն, չուկա, ընկույզի սոուս)`
    },
    {
        id: 20,
        title: 'Կանադա',
		price: '4300 դրամ',
		description: `(պանիր, վարունգ, սաղմոն, օձաձուկ, ունագի սոուս, քունջութ)`
    },
    {
        id: 21,
        title: 'Կալիֆորնիա սաղմոն',
		price: '3850 դրամ',
		description: `(պանիր, սաղմոն, վարունգ, կարմիր մասագո)`
    },
    {
        id: 22,
        title: 'Բոնիտո',
		price: '3100 դրամ',
		description: `(պանիր, սաղմոն, վարունգ, թունայի թեփուկ)`
    },
    {
        id: 23,
        title: 'Գո',
		price: '3600 դրամ',
		description: `(պանիր, սաղմոն, վարունգ, տապակած մասագոյի սոուս, ունագի սոուս)`
    },
    {
        id: 24,
        title: 'Խայտեկ',
		price: '3300 դրամ',
		description: `(պանիր, թունա, սաղմոն, տեմպուրա)`
    },
    {
        id: 25,
        title: 'Սյակե տեմպուրա',
		price: '3300 դրամ',
		description: `(պանիր, ավոկադո, սաղմոն, տեմպուրա)`
    },
    {
        id: 26,
        title: 'Էբի տեմպուրա',
		price: '3300 դրամ',
		description: `(պանիր, կոճապղպեղ, մանրածովախեցգետին, տեմպուրա)`
    },
    {
        id: 27,
        title: 'Խիտուշի',
		price: '3600 դրամ',
		description: `(պանիր, վարունգ, ծովախեցգետին, կծու սոուս, ունագի սոուս, կանաչ սոխ)`
    },
    {
        id: 28,
        title: 'Կծու տեմպուրա',
		price: '3200 դրամ',
		description: `(սրիռաչա կաղամարի տեմպուրա, տեմպուրա կծու սոուս, ունագի սոուս, չիլիի թելեր)`
    },
    {
        id: 29,
        title: 'Սուշի բուրգեր սաղմոնով',
		price: '3500 դրամ',
		description: `(պանիր, սաղմոն, ավոկադո, ունագի սոուս, կծու սոուս, կանաչ սոխ)`
    },
    {
        id: 30,
        title: 'Սուշի բուրգեր օձաձուկ',
		price: '3700 դրամ',
		description: `(պանիր, օձաձուկ, վարունգ, կծու սոուս, ունագի սոուս, կանաչ սոխ)`
    },
    {
        id: 31,
        title: 'Կապպա մակի',
		price: '1500 դրամ',
		description: `(վարունգ, նորի, բրինձ, քունջութ)`
    },
    {
        id: 32,
        title: 'Սուշի սաղմոն',
        price: '700 դրամ',
        description: ``
    },
    {
        id: 33,
        title: 'Սուշի օձաձուկ',
        price: '800 դրամ',
        description: ``
    },
    {
        id: 34,
        title: 'Սուշի մանրածովախեցգետին',
        price: '800 դրամ',
        description: ``
    },
    {
        id: 35,
        title: 'Սուշի թունա',
        price: '700 դրամ',
        description: ``
    },
    {
        id: 36,
        title: '4 պանիր',
		price: '3500 դրամ',
		description: `(մոցարելա, պառմեզան, գաուդա, դոռբլու, օրեգանո)`
    },
    {
        id: 37,
        title: 'Մսային',
		price: '4000 դրամ',
		description: `(կարմիր սոուս, մոցարելա, խոզապուխտ, սալյամի, բեկոն, հավի միս, խոզի միս, օրեգանո)`
    },
    {
        id: 38,
        title: 'Հավայան',
		price: '3300 դրամ',
		description: `(սպիտակ սոուս, մոցարելա, հավի միս, անանաս, օրեգանո)`
    },
    {
        id: 39,
        title: 'Պեպերոնի',
		price: '3300 դրամ',
		description: `(կարմիր սոուս, մոցարելա, պեպերոնի, պառմեզան, օրեգանո)`
    },
    {
        id: 40,
        title: 'Մարգարիտա',
		price: '3000 դրամ',
		description: `(կարմիր սոուս, մոցարելա, լոլիկ, օրեգանո)`
    },
    {
        id: 41,
        title: 'Դիաբլո 🌶️',
		price: '3500 դրամ',
		description: `(կարմիր սոուս, մոցարելա, սալյամի, բեկոն, հալապենյո, թթու վարունգ)`
    },
    {
        id: 42,
        title: 'Ժուլիեն',
		price: '3400 դրամ',
		description: `(սպիտակ սոուս, մոցարելա, հավի միս, սունկ, կանաչի, պառմեզան, օրեգանո)`
    },
    {
        id: 43,
        title: 'Խոզապուխտ և սունկ',
		price: '3500 դրամ',
		description: `(կարմիր սոուս, մոցարելա, սունկ, լոլիկ, խոզապուխտ, օրեգանո)`
    },
    {
        id: 44,
        title: '4 համ',
		price: '3800 դրամ',
		description: `(կարմիր սոուս, մոցարելա, պեպերոնի, սունկ, խոզապուխտ, լոլիկ, հավի միս, բեկոն, բիբար, օրեգանո)`
    },
    {
        id: 45,
        title: 'Սեթ-1',
		price: '11000 դրամ',
		description: `(32 կտոր)`
    },
    {
        id: 46,
        title: 'Սեթ-2',
		price: '14000 դրամ',
		description: `(56 կտոր)`
    },
    {
        id: 47,
        title: 'Սեթ-3',
		price: '16000 դրամ',
		description: `(40 կտոր)`
    },
    {
        id: 48,
        title: 'Սեթ-4',
		price: '12000 դրամ',
		description: `(32 կտոր)`
    },
];

const App: React.FC = () => {
    return (
        <div className="wrapper">
            <div className="logo">
                <img src={Logo} alt="logo" />
            </div>
            <h2 className="page_title">Մենյու</h2>
            <div className="menu_additional_info">
                <p>*Կատարելով գնումներ կստանաք նվեր պիցցա՝</p>
                <ul>
                    <li>10000-ից մինչև 15000 դրամի դեպքում կստանաք նվեր պիցցա "Մարգարիտա"</li>
                    <li>15000-ից մինչև 20000 դրամի դեպքում կստանաք նվեր պիցցա "Ժուլիեն"</li>
                    <li>20000 դրամ և ավելիի դեպքում կստանաք նվեր պիցցա "4 համ"</li>
                </ul>
            </div>
            <div className="menu_item_list">
                {
                    menuItems.map(item => (
                        <div
                            key={`menu_item_${item.id}`}
                            className="menu_item"
                        >
                            <div className="menu_item_image">
                                <img src={`/menu_item_images/${item.id}.jpg`} alt="" />
                            </div>
                            <div className="menu_item_title_box">
                                <h3 className="menu_item_title">{item.title}</h3>
                                <span className="menu_item_price">{item.price}</span>
                            </div>
                            <div className="menu_item_description" dangerouslySetInnerHTML={{__html: item.description}} />
                        </div>
                    ))
                }
            </div>
        </div>
    );
};

export default App;
